<?php
/*13. Есть строка $string = 'яблоко черешня вишня вишня черешня груша яблоко черешня вишня яблоко вишня вишня черешня груша
яблоко черешня черешня вишня яблоко вишня вишня черешня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня
 черешня груша яблоко черешня вишня'
Подсчитайте, сколько раз каждый фрукт встречается в этой строке. Выведите  в виде списка в порядке уменьшения количества:

Пример вывода:
яблоко – 12<br>
черешня – 8<br>
груша – 5<br>
слива - 3<br>
*/
$string = <<<EOT
яблоко черешня вишня вишня черешня груша яблоко черешня вишня яблоко вишня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня черешня груша яблоко черешня вишня
EOT;

echo $string."<br>";

$array = explode(" ",$string);
$res = array_count_values($array);

foreach ($res as $key => $value){
    echo "$key - $value <br>";
}
